---
type: DocumentOpeningEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DocumentOpeningEventArgs

`Autodesk.Revit.DB.Events.DocumentOpeningEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | DocumentType | 2010 | `public DocumentType DocumentType { get ; }` |
| Property | PathName | 2010 | `public string PathName { get ; }` |